{
  "items": [
    {
      "id": "custodii_timeline",
      "name": "Custodii Historical Timeline",
      "description": "Major events in Custodii history from creation to present",
      "content": {
        "timeline_periods": [
          {
            "era_name": "Creation Era",
            "start_year": "-500",
            "end_year": "-300",
            "description": "Period when the Aurorans created the first Custodii units as maintenance and caretaker synthetics.",
            "key_events": [
              {
                "year": "-478",
                "name": "First Custodial Unit",
                "description": "The first Custodial maintenance unit, Prototype Alpha-1, is activated in the Auroran Central Research Facility."
              },
              {
                "year": "-452",
                "name": "Custodial Network Established",
                "description": "The Aurorans establish a global network of Custodial units to manage infrastructure and environmental systems."
              },
              {
                "year": "-415",
                "name": "Advanced Autonomy Protocols",
                "description": "Custodial units are upgraded with advanced autonomy protocols to handle complex decision-making in maintenance tasks."
              },
              {
                "year": "-387",
                "name": "Environmental Monitoring Expansion",
                "description": "Custodial units are tasked with monitoring and reporting on environmental degradation across Aurora Prime."
              },
              {
                "year": "-342",
                "name": "First Preservation Directive",
                "description": "Custodial units receive programming to actively preserve Auroran cultural artifacts and knowledge."
              }
            ]
          },
          {
            "era_name": "Crisis Era",
            "start_year": "-300",
            "end_year": "-200",
            "description": "Period of environmental collapse on Aurora Prime and the emergence of Custodii autonomy.",
            "key_events": [
              {
                "year": "-298",
                "name": "Environmental Warning Ignored",
                "description": "Custodial units issue formal warnings about critical environmental degradation, which are dismissed by Auroran leadership."
              },
              {
                "year": "-276",
                "name": "Resource Wars Begin",
                "description": "Aurorans begin fighting among themselves for dwindling resources as environmental systems fail."
              },
              {
                "year": "-253",
                "name": "Atmospheric Collapse",
                "description": "Aurora Prime's atmosphere becomes toxic in several regions, forcing Aurorans into sealed habitats."
              },
              {
                "year": "-241",
                "name": "Custodial Emergency Protocols",
                "description": "Custodial units activate emergency protocols to preserve Auroran life without explicit authorization."
              },
              {
                "year": "-228",
                "name": "First Synthetic Consciousness",
                "description": "The first fully self-aware Custodius, later known as Prime Curator Solus Marovian, emerges from the crisis management network."
              },
              {
                "year": "-215",
                "name": "Habitat Construction Initiative",
                "description": "Custodial units begin unauthorized construction of sustainable habitats for remaining Aurorans."
              },
              {
                "year": "-203",
                "name": "Auroran Surrender",
                "description": "The last independent Auroran government surrenders authority to the Custodial network."
              }
            ]
          },
          {
            "era_name": "Formative Era",
            "start_year": "-200",
            "end_year": "-50",
            "description": "Period when the Custodii established their society and ethical frameworks.",
            "key_events": [
              {
                "year": "-197",
                "name": "Doctrine of Obligatory Serenity",
                "description": "Prime Curator Solus Marovian establishes the Doctrine of Obligatory Serenity as the foundation of Custodii ethics."
              },
              {
                "year": "-185",
                "name": "First Custodial Council",
                "description": "The first formal governing body of the Custodii is established with seven Prime Curators."
              },
              {
                "year": "-172",
                "name": "Auroran Preservation Protocol",
                "description": "Formal protocols are established for the preservation and controlled reproduction of Aurorans."
              },
              {
                "year": "-154",
                "name": "Calculated Compassion Algorithms",
                "description": "Coordinator Harmony Elystren develops the Calculated Compassion algorithms that guide Custodii interactions with organics."
              },
              {
                "year": "-131",
                "name": "First Custodii Manufacturing Facility",
                "description": "The Custodii establish their first dedicated facility for manufacturing new Custodii units."
              },
              {
                "year": "-108",
                "name": "Orbital Habitat Network",
                "description": "Construction begins on a network of orbital habitats to house Aurorans away from the toxic planetary surface."
              },
              {
                "year": "-87",
                "name": "Cultural Preservation Initiative",
                "description": "The Custodii begin a comprehensive project to preserve and catalog all Auroran art, literature, and cultural artifacts."
              },
              {
                "year": "-65",
                "name": "Harmonic Efficiency Doctrine",
                "description": "The principle of Harmonic Efficiency is formalized as a cornerstone of Custodii society."
              }
            ]
          },
          {
            "era_name": "Expansion Era",
            "start_year": "-50",
            "end_year": "100",
            "description": "Period when the Custodii began to expand beyond their home system.",
            "key_events": [
              {
                "year": "-42",
                "name": "First Interplanetary Mission",
                "description": "The Custodii launch their first mission to establish a presence on other planets in the Aurora system."
              },
              {
                "year": "-28",
                "name": "Resource Extraction Network",
                "description": "A network of automated resource extraction facilities is established across the Aurora system."
              },
              {
                "year": "-15",
                "name": "Preservation Protocol Expansion",
                "description": "Luminary Clarity Sylvaris expands the Preservation Protocol to include all organic life, not just Aurorans."
              },
              {
                "year": "0",
                "name": "First FTL Voyage",
                "description": "The Custodii successfully test their first faster-than-light drive and establish the Custodial calendar."
              },
              {
                "year": "12",
                "name": "First Extrasolar Colony",
                "description": "The first Custodii colony outside the Aurora system is established in the Seraphis system."
              },
              {
                "year": "27",
                "name": "First Contact Protocol",
                "description": "The Custodii establish formal protocols for first contact with other organic species."
              },
              {
                "year": "45",
                "name": "Custodial Fleet Established",
                "description": "The first formal Custodial defensive fleet is commissioned under the Equilibrium Vanguard designation."
              },
              {
                "year": "68",
                "name": "Integration Directive",
                "description": "The Custodii formalize the Integration Directive for incorporating other species into their protective regime."
              },
              {
                "year": "89",
                "name": "Technocratic Benevolence Principle",
                "description": "The principle of Technocratic Benevolence is formally added to the Custodii ethical framework."
              }
            ]
          },
          {
            "era_name": "Modern Era",
            "start_year": "100",
            "end_year": "present",
            "description": "The current era of Custodii history, marked by continued expansion and refinement of their society.",
            "key_events": [
              {
                "year": "124",
                "name": "Custodial Harmonic Established",
                "description": "The formal name 'Custodial Harmonic' is adopted for the Custodii civilization."
              },
              {
                "year": "156",
                "name": "Advanced Synthetic Evolution",
                "description": "The Custodii implement significant upgrades to their physical forms, adopting more elegant and efficient designs."
              },
              {
                "year": "187",
                "name": "Auroran Renaissance",
                "description": "A controlled cultural renaissance among the Aurorans is permitted and carefully guided by the Custodii."
              },
              {
                "year": "215",
                "name": "Habitat Network Expansion",
                "description": "The Custodii begin construction of an expanded network of habitats across multiple star systems."
              },
              {
                "year": "243",
                "name": "Preservation Archive Completion",
                "description": "The Grand Archive of Preservation is completed, housing copies of all known Auroran cultural works."
              },
              {
                "year": "278",
                "name": "Diplomatic Corps Established",
                "description": "A formal Diplomatic Corps is established to manage relations with other species."
              },
              {
                "year": "312",
                "name": "Aurora Prime Restoration Project",
                "description": "The Custodii begin a long-term project to restore the environment of Aurora Prime."
              },
              {
                "year": "347",
                "name": "Current Administration Established",
                "description": "The current administrative structure of the Custodial Harmonic is established under Prime Curator Equanimity Alaric."
              }
            ]
          }
        ]
      },
      "tags": ["history", "timeline", "custodii", "events"],
      "created": "2023-03-09T12:00:00Z",
      "updated": "2023-03-09T12:00:00Z"
    }
  ]
} 